#+TITLE: July 4-15, 2019 (12 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 12
  :SPRINTSTART: <2019-07-04 Thu>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-RJ722: 2
  :wpd-sandeepk: 2
  :END:
** akshay196
*** Learning GNU Emacs - Part II
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER:    akshay196
    :ID:       READ.1560794346
    :TASKID:   READ.1560794346
    :END:
    - [ ] Chapter 11. Emacs Lisp Programming                         ( 2h)
    - [ ] Chapter 12. Version Control                                ( 1h)
    - [ ] Chapter 13. Platform-specific considerations               ( 1h)
    - [ ] Chapter 14. The Help System                                ( 1h)
*** GNU Emacs bug triaging
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: akshay196
    :ID: OPS.1562238634
    :TASKID: OPS.1562238634
    :END:
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=36490][#36490]]: directory-files-recursively breaks when it encounters a directory named "~"
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35340][#35340]]: ffap: dired wildcards always needs a wildcard in the filename
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35166][#35166]]: Buffer state inconsistent after vc-retrieve-tag
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=32753][#32753]]: Bogus icomplete behavior
*** Read [[https://www.laurentluce.com/posts/python-dictionary-implementation/][Python dictionary implementation]]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1562241440
    :TASKID: READ.1562241440
    :END:
*** Read [[https://treyhunner.com/2018/06/how-to-make-an-iterator-in-python/][How to make an iterator in Python]]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1562241993
    :TASKID: READ.1562241993
    :END:
** bhavin192
*** IN_PROGRESS Namespaces in operation series [4/8]
    :PROPERTIES:
    :ESTIMATED: 3.5
    :ACTUAL:   3.47
    :OWNER:    bhavin192
    :ID:       READ.1560960967
    :TASKID:   READ.1560960967
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-10 Wed 22:04]--[2019-07-10 Wed 22:28] =>  0:24
    CLOCK: [2019-07-10 Wed 21:46]--[2019-07-10 Wed 21:55] =>  0:09
    CLOCK: [2019-07-10 Wed 19:23]--[2019-07-10 Wed 20:13] =>  0:50
    CLOCK: [2019-07-09 Tue 19:23]--[2019-07-09 Tue 20:14] =>  0:51
    CLOCK: [2019-07-08 Mon 21:35]--[2019-07-08 Mon 22:49] =>  1:14
    :END:
    https://lwn.net/Articles/531114/#series_index
    - [X] [[https://lwn.net/Articles/531381/][2: the namespaces API]]                                       (25m)
    - [X] [[https://lwn.net/Articles/531419/][3: PID namespaces]]                                           (20m)
    - [X] [[https://lwn.net/Articles/532748/][4: more on PID namespaces]]                                   (35m)
    - [X] [[https://lwn.net/Articles/532593/][5: User namespaces]]                                          (30m)
    - [ ] [[https://lwn.net/Articles/540087/][6: more on user namespaces]]                                  (25m)
    - [ ] [[https://lwn.net/Articles/580893/][7: Network namespaces]]                                       (15m)
    - [ ] [[https://lwn.net/Articles/689856/][Mount namespaces and shared subtrees]]                        (30m)
    - [ ] [[https://lwn.net/Articles/690679/][Mount namespaces, mount propagation, and unbindable mounts]]  (20m)
*** Mastering Distributed Tracing - I. Introduction [0/3]
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1562555265
    :TASKID:   READ.1562555265
    :END:
    - [ ] 1. Why Distributed Tracing?                          (42m)
    - [ ] 2. Take Tracing for a HotROD Ride                    (68m)
    - [ ] 3. Distributed Tracing Fundamentals                  (42m)
*** Mastering Distributed Tracing - II. Data Gathering Problem [0/5]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1562555265
    :TASKID:   READ.1562555265
    :END:
    - [ ] 4. Instrumentation Basics with OpenTracing           (132m)
    - [ ] 5. Instrumentation of Asynchronous Applications      (54m)
    - [ ] 6. Tracing Standards and Ecosystem                   (44m)
    - [ ] 7. Tracing with Service Meshes                       (52m)
    - [ ] 8. All About Sampling                                (60m)

** gandalfdwite
*** IN_PROGRESS Unix Concepts & Applications by Sumitabha Das Part IV [2/3]
   :PROPERTIES:
   :ESTIMATED: 9
   :ACTUAL:   7.07
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   :LOGBOOK:
   CLOCK: [2019-07-11 Thu 20:39]--[2019-07-11 Thu 21:40] =>  1:01
   CLOCK: [2019-07-10 Wed 22:05]--[2019-07-10 Wed 22:58] =>  0:53
   CLOCK: [2019-07-09 Tue 23:40]--[2019-07-10 Wed 00:20] =>  0:40
   CLOCK: [2019-07-08 Mon 21:10]--[2019-07-08 Mon 22:22] =>  1:12
   CLOCK: [2019-07-07 Sun 20:24]--[2019-07-07 Sun 21:35] =>  1:11
   CLOCK: [2019-07-06 Sat 09:15]--[2019-07-06 Sat 10:17] =>  1:02
   CLOCK: [2019-07-04 Thu 21:46]--[2019-07-04 Thu 22:51] =>  1:05
   :END:
   - [X] 13. Regular expressions                 ( 3h)
   - [X] 14. Essential shell programming         ( 3h)
   - [ ] 15. Essential System Administration     ( 3h)
*** TODO Setup Blogging Website [0/1]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: Do.1562171060
    :TASKID: Do.1562171060
    :END:
    :LOGBOOK:
    :END:
    - [ ] Finish setup and publish first blog post  ( 3h)
** RJ722
*** Write one blog post
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1562247371
    :TASKID: WRITE.1562247371
    :END:
*** Write one ~two~ blog posts - PART 2 [1/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1560491297
    :TASKID: WRITE.1560491297
    :END:
    - [ ] Post 2
*** Participate in a Kaggle Competition - PART 1
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: RJ722
    :ID: DEV.1561010265
    :TASKID: DEV.1561010265
    :END:
*** Finish fastai part-1
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:
    :OWNER: RJ722
    :ID: TASK.1562243888
    :TASKID: TASK.1562243888
    :END:
** sandeepk
*** IN_PROGRESS Blog writing - Part II [0/3]
    :PROPERTIES:
    :ESTIMATED: 14
    :ACTUAL:   0.67
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-07 Sun 21:20]--[2019-07-07 Sun 21:40] =>  0:20
    CLOCK: [2019-07-07 Sun 17:05]--[2019-07-07 Sun 17:25] =>  0:20
    :END:
    - [ ] Blog about Google Cloud Platform VPC(Virtual Private Network)       (5h)
    - [ ] Load Balancer	Setup guide                                           (6h)
    - [ ] Database Certificate genration and PyCharm linkage to Database      (3h)
*** Project Stack NEWS - Part III [0/2]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    - [ ] Implement Comment logic          (5h)
    - [ ] Write test case for POST section (5h)

